/*题目的关键是函数式f(x)=5*x^13+13*x^5+k*a*x;
  用数学归纳法证明：x取任何值都需要能被65整除..
  所以我们只需找到f(1)成立的a,并在假设f(x)成立的基础上,证明f(x+1)也成立即可。
  那么把f(x+1)展开，则f(x+1) = f (x) +  5*( (13  1 ) x^12 ...... .....+(13  13) x^0  )+  13*(  (5  1 )x^4+...........+ ( 5  5  )x^0  )+k*a;
  很容易证明，除了5*(13  13) x^0 、13*( 5  5  )x^0 和k*a三项以外,其余各项都能被65整除.
  那么也只要求出18+k*a能被65整除就可以了.
  而f(1)也正好等于18+k*a
  所以,只要找到a,使得18+k*a能被65整除,也就解决了这个题目.*/
#include<stdio.h>
int main(){
   int k,i;
   while(~scanf("%d",&k)){
      int result=-1;
      for(i=0;i<10000;++i){
        if((18+k*i)%65==0){
            result=i;
            break;
        }
      }
      if(result==-1)
        printf("no\n");
      else
        printf("%d\n",result);
   }
   return 0;
}
